
# Parameters
nc: 3 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024] # YOLOv8n summary: 225 layers,  3157200 parameters,  3157184 gradients,   8.9 GFLOPs
  s: [0.33, 0.50, 1024] # YOLOv8s summary: 225 layers, 11166560 parameters, 11166544 gradients,  28.8 GFLOPs
  m: [0.67, 0.75, 768] # YOLOv8m summary: 295 layers, 25902640 parameters, 25902624 gradients,  79.3 GFLOPs
  l: [1.00, 1.00, 1024] # YOLOv8l summary: 365 layers, 43691520 parameters, 43691504 gradients, 165.7 GFLOPs
  x: [1.00, 1.25, 1024] # YOLOv8x summary: 365 layers, 68229648 parameters, 68229632 gradients, 258.5 GFLOPs

# YOLOv8.0n backbone
backbone:
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, nn.Identity, []] # 1-P1/2   
  - [-1, 1, Conv, [128, 3, 2]] # 2-P2/4
  - [-1, 1, nn.Identity, []] # 3-P3/4
  - [-1, 1, AFE, [128]] # 4/6  64
  
  - [-1, 1, PoolDown, [256, 3, 2]] # 5-P4/8 170/213  
  - [-1, 1, AFE, [256]] # 6/9   128

  - [-1, 1, PoolDown, [512, 3, 2]] # 7-P5/16
  - [-1, 1, AFE, [512]] # 8/33   256
  - [-1, 1, nn.Identity, []] # 9   

head:
  - [[9, 6, 4], 1, TPFusion, []] # 10-P4/16

  - [10, 1, Conv, [256, 3, 2]] # 11-P5/32
  - [[-1, 9], 1, Concat, [1]]  
  - [-1, 3, C2f, [512]]  # 13-P5/32

  - [10, 1, nn.Upsample, [None, 2, 'nearest']] # 14-P3/8
  - [[-1, 4], 1, Concat, [1]]  
  - [-1, 3, C2f, [256]]  # 16-P3/8  输出192

  - [[13, 10, 16], 1, TPFusion, []] # 17-P4/16 

  - [17, 1, Conv, [256, 3, 2]] # 18-P5/32
  - [[11, 18, 13], 1, Concat, [1]]  
  - [-1, 3, C2f, [512]]  # 20-P5/32 输出384

  - [17, 1, nn.Upsample, [None, 2, 'nearest']] # 21-P3/8
  - [[14, 21, 16], 1, Concat, [1]]  
  - [-1, 3, C2f, [256]]  # 23-P3/8 输出192


  - [4, 1, Conv, [256]] # 24
  - [6, 1, Conv, [576]] # 25
  - [[24, 23], 1, AFusion, []] # 26 (P3/8-small)   4+11.cc
  - [[25, 17], 1, AFusion, []] # 27 (P4/16-medium)  9+12
  - [[9, 20], 1, AFusion, []] # 28 (P5/32-large)  6+22

  - [[26, 27, 28], 1, Detect, [nc]]  # Detect(P3, P4, P5)
